src/DataProcessors/АттестацииРаботников/АттестацииРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АттестацииРаботников</name>
  <tabularSections>
    <name>Работники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/ОценкиКомпетенцийРаботников/ОценкиКомпетенцийРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкиКомпетенцийРаботников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оценка</name>
    <type>
      <types>CatalogRef.СоставОценочныхШкалКомпетенций</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Компетенция</name>
    <type>
      <types>CatalogRef.КомпетенцииРаботников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Работники/Работники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Работники</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <attributes>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаУвольнения</name>
    <type>
      <types>CatalogRef.ОснованияУвольнения</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ПричиныИзмененияСостояния/ПричиныИзмененияСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныИзмененияСостояния</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПриемНаРаботу</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Documents/АттестацияРаботника/АттестацияРаботника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АттестацияРаботника</name>
  <comment>(Упр)</comment>
  <registerRecords>InformationRegister.ОценкиКомпетенцийРаботников</registerRecords>
  <attributes>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокКомпетенций</name>
    <attributes>
      <name>Компетенция</name>
      <type>
        <types>CatalogRef.КомпетенцииРаботников</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>CatalogRef.СоставОценочныхШкалКомпетенций</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОценки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/СотрудникиОрганизаций/СотрудникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СотрудникиОрганизаций</name>
  <basedOn>Catalog.ФизическиеЛица</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровСФизЛицами</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.ВидыЗанятостиВОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспытательныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаТарифнойСтавки</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостфиксНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифныйРазряд</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеНазначение</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВзносов</name>
    <type>
      <types>CatalogRef.ГруппыВзносовВФонды</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяДолжностьОрганизации</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееПодразделениеКомпании</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяДолжностьКомпании</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаНаРаботуВКомпанию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольненияИзКомпании</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПерсональныеНадбавки</name>
    <attributes>
      <name>Надбавка</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта1</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта2</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта3</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта4</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд1</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд2</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд3</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд4</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта5</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта6</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд5</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд6</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/КомпетенцииРаботников/КомпетенцииРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомпетенцииРаботников</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОписаниеКомпетенции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценок</name>
    <type>
      <types>CatalogRef.ШкалыОценокКомпетенций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТиповаяАнкета</name>
    <type>
      <types>CatalogRef.ТиповыеАнкеты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОписаниеОценок</name>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>CatalogRef.СоставОценочныхШкалКомпетенций</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОценки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриоритетОценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесОценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/АттестацииРаботников/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Клиент Тогда

// Процедура построения справки на кандидата.
//
// Параметры: 
//  ФизЛицо        - Тип Элемент справочника "ФизическиеЛица"	
//  Подразделение  - Тип Элемент справочника "Подразделения"
//  Должность      - Тип Элемент справочника "Должности"
//
//
Процедура ПостроитьСправку(ТабличныйДокумент, ТекущиеДанные) Экспорт
	
	ТабличныйДокумент.Очистить();
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Вывод шапки
	Макет = ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Работник		= ТекущиеДанные.Сотрудник;
	
	ТабличныйДокумент.Вывести(Область);
	
	// Данные для списка не оцененых компетенций.
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Сотрудник", ТекущиеДанные.Сотрудник);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АттестацияРаботникаСписокКомпетенций.Компетенция КАК Компетенция,
	|	АттестацияРаботникаСписокКомпетенций.Ссылка.Ссылка КАК Документ,
	|	АттестацияРаботникаСписокКомпетенций.Ссылка.Ответственный,
	|	АттестацияРаботникаСписокКомпетенций.Ссылка.Дата
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АттестацияРаботника.СписокКомпетенций КАК АттестацияРаботникаСписокКомпетенций
	|		ПО СотрудникиОрганизаций.Физлицо = АттестацияРаботникаСписокКомпетенций.Ссылка.Физлицо
	|ГДЕ
	|	(НЕ АттестацияРаботникаСписокКомпетенций.Ссылка.Проведен)
	|	И (НЕ АттестацияРаботникаСписокКомпетенций.Ссылка.ПометкаУдаления)
	|	И СотрудникиОрганизаций.Ссылка = &Сотрудник";
	
	НеоцененныеКомпетенции = Запрос.Выполнить().Выбрать();

	// Вывод не оцененых компетенций.
	
	Область = Макет.ПолучитьОбласть("СтрокаСправки");
	
	Если НеоцененныеКомпетенции.Количество() = 0 Тогда
		Область.Параметры.Компетенция   = "Нет компетенций";
		Область.Параметры.Ответственный = "--";
		Область.Параметры.Дата          = "--";
		Область.Параметры.Документ      = "Нет документов";
		ТабличныйДокумент.Вывести(Область);
		
	Иначе
		
		Пока НеоцененныеКомпетенции.Следующий() Цикл
		
			ЗаполнитьЗначенияСвойств(Область.Параметры, НеоцененныеКомпетенции);
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Вывод заголовка для последних оценок компетнций.
	Область = Макет.ПолучитьОбласть("ШапкаДва");
	ТабличныйДокумент.Вывести(Область);
	
	// Данные для списка последних оцененок компетенций.
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОценкиКомпетенцийРаботников.Компетенция,
	|	ОценкиКомпетенцийРаботников.Оценка,
	|	ОценкиКомпетенцийРаботников.Период КАК Дата,
	|	ОценкиКомпетенцийРаботников.Регистратор КАК Документ
	|ИЗ
	|	РегистрСведений.ОценкиКомпетенцийРаботников.СрезПоследних(
	|			,
	|			Физлицо В
	|				(ВЫБРАТЬ
	|					СотрудникиОрганизаций.Физлицо
	|				ИЗ
	|					Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|				ГДЕ
	|					СотрудникиОрганизаций.Ссылка = &Сотрудник)) КАК ОценкиКомпетенцийРаботников";
	
	ОцененныеКомпетенции = Запрос.Выполнить().Выбрать();

	// Вывод последних оцененок компетенций
	Область = Макет.ПолучитьОбласть("СтрокаСправкиДва");
	
	Если ОцененныеКомпетенции.Количество() = 0 Тогда
		Область.Параметры.Компетенция	= "Нет компетенций";
		Область.Параметры.Оценка		= "--";
		Область.Параметры.Дата			= "--";
		Область.Параметры.Документ		= "Нет документов";
		ТабличныйДокумент.Вывести(Область);
		
	Иначе

		Пока ОцененныеКомпетенции.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(Область.Параметры, ОцененныеКомпетенции);
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ПостроитьСправку()

// Процедура фрмирует диаграмму "Распределения оценок". 
//
// Параметры
//  Нет  
//  	
Процедура СформироватьДиаграмму(Диаграмма, Компетенция, НачПериода, КонПериода, Должность) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Компетенция) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Компетенция",			Компетенция);
	Запрос.УстановитьПараметр("ШкалаОценок",			Компетенция.ШкалаОценок);
	
	Запрос.УстановитьПараметр("НачПериода",				НачПериода);
	Запрос.УстановитьПараметр("КонПериода",				КонПериода);
	
	Запрос.УстановитьПараметр("Должность",				Должность);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Шкала.Представление,
	|	ВЫРАЗИТЬ(Шкала.ВесОценки * ВЫБОР
	|			КОГДА ИтогиОжидания.ВесОценки = 0
	|				ТОГДА 1
	|			ИНАЧЕ ИтогиРезультат.Количество / ИтогиОжидания.ВесОценки
	|		КОНЕЦ КАК ЧИСЛО(3, 0)) КАК Ожидания,
	|	ЕСТЬNULL(Данные.Количество, 0) КАК Результат
	|ИЗ
	|	(ВЫБРАТЬ
	|		СоставОценочныхШкалКомпетенций.Наименование КАК Наименование,
	|		СоставОценочныхШкалКомпетенций.Ссылка КАК Ссылка,
	|		СоставОценочныхШкалКомпетенций.ПриоритетОценки КАК ПриоритетОценки,
	|		СоставОценочныхШкалКомпетенций.Представление КАК Представление,
	|		Веса.ВесОценки КАК ВесОценки
	|	ИЗ
	|		Справочник.СоставОценочныхШкалКомпетенций КАК СоставОценочныхШкалКомпетенций
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				КомпетенцииРаботниковОписаниеОценок.Оценка КАК Оценка,
	|				КомпетенцииРаботниковОписаниеОценок.ВесОценки КАК ВесОценки
	|			ИЗ
	|				Справочник.КомпетенцииРаботников.ОписаниеОценок КАК КомпетенцииРаботниковОписаниеОценок
	|			ГДЕ
	|				КомпетенцииРаботниковОписаниеОценок.Ссылка = &Компетенция) КАК Веса
	|			ПО СоставОценочныхШкалКомпетенций.Ссылка = Веса.Оценка
	|	ГДЕ
	|		СоставОценочныхШкалКомпетенций.Владелец = &ШкалаОценок) КАК Шкала
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОценкиКомпетенцийРаботников.Оценка КАК Оценка,
	|			СУММА(1) КАК Количество
	|		ИЗ
	|			РегистрСведений.ОценкиКомпетенцийРаботников.СрезПоследних(
	|				&КонПериода,
	|				Период МЕЖДУ &НачПериода И &КонПериода
	|				    И Компетенция = &Компетенция) КАК ОценкиКомпетенцийРаботников
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(&КонПериода, ) КАК Работники
	|				ПО Работники.ФизЛицо = ОценкиКомпетенцийРаботников.ФизЛицо
	|		ГДЕ
	|			Работники.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|			//УСЛОВИЕ_ДОЛЖНОСТЬ
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОценкиКомпетенцийРаботников.Оценка) КАК Данные
	|		ПО Шкала.Ссылка = Данные.Оценка,
	|	(ВЫБРАТЬ
	|		СУММА(1) КАК Количество
	|	ИЗ
	|		РегистрСведений.ОценкиКомпетенцийРаботников.СрезПоследних(
	|			&КонПериода,
	|			Период МЕЖДУ &НачПериода И &КонПериода
	|			    И Компетенция = &Компетенция) КАК ОценкиКомпетенцийРаботников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(&КонПериода, ) КАК Работники
	|			ПО Работники.ФизЛицо = ОценкиКомпетенцийРаботников.ФизЛицо
	|	ГДЕ
	|		Работники.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|		//УСЛОВИЕ_ДОЛЖНОСТЬ
	|) КАК ИтогиРезультат,
	|	(ВЫБРАТЬ
	|		СУММА(КомпетенцииРаботниковОписаниеОценок.ВесОценки) КАК ВесОценки
	|	ИЗ
	|		Справочник.КомпетенцииРаботников.ОписаниеОценок КАК КомпетенцииРаботниковОписаниеОценок
	|	ГДЕ
	|		КомпетенцииРаботниковОписаниеОценок.Ссылка = &Компетенция) КАК ИтогиОжидания
	|
	|УПОРЯДОЧИТЬ ПО
	|	Шкала.ПриоритетОценки";
	
	Если ЗначениеЗаполнено(Должность) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_ДОЛЖНОСТЬ", "И Работники.Должность.Должность = &Должность");
	КонецЕсли;
	
	Диаграмма.СерииВСтроках = Ложь;
	Диаграмма.ОтображатьЗаголовок = Ложь;
	
	Диаграмма.ОбластьЗаголовка.Текст = "Распределение оценок компетенции " + Компетенция.Наименование;
	Диаграмма.ИсточникДанных = Запрос.Выполнить();
	
КонецПроцедуры  // СформироватьДиаграмму()

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
